// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// const arr = ['a', 'b', 'c']
// for (let i = 1; i <= 3; i++) {

//       arr.push(i)
// }
// console.log(arr);

//========================================================================================================

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// const arr = [1, 2, 3]
// arr.reverse()
// console.log(arr);

//==========================================================================

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// const arr = [1, 2, 3]
// for (let i = 4; i <= 6; i++) {

//       arr.push(i)
// }
// console.log(arr);

//============================================================================

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// const arr = [1, 2, 3]
// for (let i = 4; i <= 6; i++) {

//       arr.unshift(i)
// }
// console.log(arr);

//=====================================================================================

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// const arr  = ['js', 'css', 'jq']
// document.write(arr.shift()) 

// =========================================================================================

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// const arr  = ['js', 'css', 'jq']
// document.write(arr.pop()) 

//=================================================================================================

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// const arr = [1, 2, 3, 4, 5]
// console.log(arr.slice(3));

//===============================================================================================

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// const arr = [1, 2, 3, 4, 5]
// console.log(arr.slice(0, 2))
//=================================================================================================

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// const arr = [1, 2, 3, 4, 5]
// arr.splice(1, 2)
// console.log(arr);

//==================================================================================

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// const arr = [1, 2, 3, 4, 5]
// arr.splice(3, 0, 'a', 'b', 'c')
// console.log(arr);

//============================================================================================================

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// const arr = [1, 2, 3, 4, 5]
// arr.splice(2, 0, 'a', 'b')
// arr.splice(-1, 0, 'c')
// arr.splice(8, 0, 'e')
// console.log(arr);

//================================================================================================
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// const arr = [2, 6, 98, 45, 125, 365, 76, 148, 66, 99]
// for (let i = 0; i < arr.length; i++) {
//       if(arr[i]%2===0){
//             console.log(arr[i]);
//       }

// }

//================================================================================================

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () 
//скопіювати значення одного масиву в інший
// const arr = [2, 6, 98, 45, 125, 365, 76, 148, 66, 99]
// const arr2 = []
// arr.forEach(element => {
//       arr2.push(element)
// });
// console.log(arr2);

//========================================================================================

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати 
//значення одного масиву в інший. 

// const arr = [2, 6, 98, 45, 125, 365, 76, 148, 66, 99]
// const arr2 = []
// for (const iterator of arr) {
//       arr2.unshift(iterator)
// }
// arr2.reverse()
// console.log(arr2);

// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

// const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
// 1. перебрати його циклом while
// let i = 0;
// while (i < arr.length) {
//       console.log(arr[i]);
//       i++
// }

//======================================================================
// 2. перебрати його циклом for

// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
      
// }

//====================================================================
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// while (i < arr.length) {
//       if(i%2!=0){
//             console.log(arr[i]);
//       }
//       i++
// }
//==================================================================
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < arr.length; i++) {
//        if (i % 2 != 0) {
//             console.log(arr[i]);
//                    }
      
// }

//=========================================================================
// 5. перебрати циклом while та вивести  числа тільки парні  значення

// i=0
// while (i < arr.length) {

//       if(arr[i]%2===0){
//             console.log(arr[i]);
//       }
      
//       i++
// }
//===========================================================
// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 0; i < arr.length; i++) {

//       if (arr[i] % 2 === 0) {
//                         console.log(arr[i]);
//                   }
      
// }

//=================================================================
// 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < arr.length; i++) {
//      if (arr[i]%3) {
//          arr[i] = 'okten'
//      }
      
// }
// console.log(arr);

//============================================================================

// 8. вивести масив в зворотньому порядку.

// console.log(arr.reverse());

//=========================================================
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 1. перебрати його циклом while
// let i = 10;
// while (i >= 0) {
//       console.log(arr[i]);
//       i--
// }

//======================================================================
// 2. перебрати його циклом for

// for (let i = 10; i >= 0; i--) {
//     console.log(arr[i]);

// }
//=====================================================
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 10;
// while (i >= 0) {
//       if(i%2!=0){
//             console.log(arr[i]);
//       }
//       i--
// }

//=================================================================
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 10; i >=0; i--) {
//        if (i % 2 != 0) {
//             console.log(arr[i]);
//                    }

// }

//=========================================================================
// 5. перебрати циклом while та вивести  числа тільки парні  значення

// i= 10
// while (i >=0) {

//       if(arr[i]%2===0){
//             console.log(arr[i]);
//       }

//       i--
// }
//===========================================================
// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 10; i >= 0; i--) {

//       if (arr[i] % 2 === 0) {
//                         console.log(arr[i]);
//                   }

// }

//=================================================================
// 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 10; i >= 0; i--) {
//      if (arr[i]%3) {
//          arr[i] = 'okten'
//      }

// }
// console.log(arr);

//======================================================
// 10
//  створити пустий масив та :
// const arr = []
// - заповнити його 50 парними числами за допомоги циклу.
// for (let i = 1; i < 101; i++) {
      
//       if(i%2===0)
//       arr.push(i)
// }
// console.log(arr);

// - заповнити його 50 непарними числами за допомоги циклу.

// for (let i = 1; i < 101; i++) {

//       if (i % 2)
//             arr.push(i)
// }
// console.log(arr);

//====================================================================
// 1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу. (ПОВТОР!!)
//        b. заповнити його 50 непарними числами за допомоги циклу. (ПОВТОР!!)
//        c. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// const arr = []
// for (let i = 0; i < 50; i++) {
    
//       arr.push(Math.floor(Math.random() * 100))
      
// }
// console.log(arr);

// for (let i = 0; i < 50; i++) {
      
//         min = Math.ceil(8);
//         max = Math.floor(732);
//         arr.push(Math.floor(Math.random() * (max - min)) + min)
// }
// console.log(arr);


//=====================================================

//  2. Вивести за допомогою console.log кожен третій елемен

// for (let i = 0; i < arr.length; i++) {
//      if (i%3===0) {
//         console.log(arr[i])   
//      }
      
// }




//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.

// for (let i = 0; i < arr.length; i++) {
//       if (i % 3 === 0 && arr[i]%2===0) {
//             console.log(arr[i])
//       }

// }
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// const arr2 = []
// for (let i = 0; i < arr.length; i++) {
//       if (i % 3 === 0 && arr[i] % 2 === 0) {
//             console.log(arr[i])
//             arr2.push(arr[i])
//       }

// }
// console.log(arr2);

//=================================================================
//  5. Вивести кожен елемент масиву, сусід зпарва якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// const arr = [1, 2, 3, 5, 7, 9, 56, 8, 67]

// for (let i = 0; i < arr.length; i++) {
//       if(arr[i]%2===0)
//       console.log(arr[i-1]);
// }
//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
// const arr = [100, 250, 50, 168, 120, 345, 188]
// let sum = 0
// for (const iterator of arr) {
//       sum += iterator
// }
// let averageCheck = sum/arr.length
// console.log(averageCheck);

//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// const arr = []
// for (let i = 0; i < 10; i++) {

//       arr.push(Math.floor(Math.random() * 100))

// }
// console.log(arr);
// const arr2 = []
// for (let i = 0; i < arr.length; i++) {
//       let el = arr[i]*5
//       arr2.push(el)
// }
// console.log(arr2);

//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.

// const arr = [12, true, 'okten', 12, -56, 'Java Script', false, 'html', 333]
// const arr2 = []
// for (let i = 0; i < arr.length; i++) {
//       if (typeof arr[i] === 'number') {
//             arr2.push(arr[i])
//       }
      
// }
// console.log(arr2);